app/Models/MKategori.php

    public function AllData()
    {
        return $this->db->table('tbl_kategori')
        ->get()
        ->getResultArray();
---
SELECT *
FROM `tbl_kategori`