app/Models/MProduk.php

    public function EditData($data)
    {
        $this->db->table('tbl_produk')
            ->where('id_produk', $data['id_produk'])
            ->update($data);
---
UPDATE `tbl_produk` SET `id_produk` = '17', `kode_produk` = NULL, `nama_produk` = NULL, `harga_beli` = NULL, `harga_jual` = NULL, `stok` = NULL
WHERE `id_produk` = '17'